In [42]:
my_dictionary={"name":"person 1", "age":35,"salary":600}

In [4]:
print(my_dictionary)

{'name': 'person 1', 'age': 35, 'salary': 600}

my_dictionary={"name":["person 1","person 2", "person 3","person 4", "person 5"],"age":[35, 100, 34,456,67],"salary":[600,400,450,332,75000]} # this adds multiple people

In [7]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [600, 400, 450, 332, 75000]}

In [9]:
#to add another key location in the dictionary
my_dictionary["location"]= ["kakamega", "mombasa", "kisumu", "moyale", "marsabit"]

In [10]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [600, 400, 450, 332, 75000],
 'location': ['kakamega', 'mombasa', 'kisumu', 'moyale', 'marsabit']}

In [ ]:
#to delete a key use del
del my_dictionary["age"]

In [11]:
#to access everyitem in the dictionary
for key, value in my_dictionary.items():
    print(key,value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [600, 400, 450, 332, 75000]
location ['kakamega', 'mombasa', 'kisumu', 'moyale', 'marsabit']

for key, value in my_dictionary.items():
    print(key,value)

In [12]:
for key, value in my_dictionary.items():
    print(key,value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [600, 400, 450, 332, 75000]
location ['kakamega', 'mombasa', 'kisumu', 'moyale', 'marsabit']

In [13]:
"""create a dictionary with 2 students listing their age and gender
add another key called specialization
add another key called intern status
delete key called age"""

'create a dictionary with 2 students listing their age and gender\nadd another key called specialization\nadd another key called intern status\ndelete key called age'

In [23]:
import pandas as pd

In [26]:
# we want to create a dataframe from the above dictionary, a df is
df=pd.DataFrame(my_dictionary)

In [27]:
df

       name  age  salary  location
0  person 1   35     600  kakamega
1  person 2  100     400   mombasa
2  person 3   34     450    kisumu
3  person 4  456     332    moyale
4  person 5   67   75000  marsabit

In [28]:
df["name"] # this is when you just want to acesss one column TO access more that one column use two [[]]

0    person 1
1    person 2
2    person 3
3    person 4
4    person 5
Name: name, dtype: object

In [31]:
df["age"]+1

0     36
1    101
2     35
3    457
4     68
Name: age, dtype: int64

In [32]:
df.dtypes

name        object
age          int64
salary       int64
location    object
dtype: object

In [33]:
df

       name  age  salary  location
0  person 1   35     600  kakamega
1  person 2  100     400   mombasa
2  person 3   34     450    kisumu
3  person 4  456     332    moyale
4  person 5   67   75000  marsabit

In [40]:
#to update the new age in the table, 
df["age"]=df["age"]+1

In [43]:
df["salary"]+2

0      602
1      402
2      452
3      334
4    75002
Name: salary, dtype: int64

In [44]:
df["salary"]=df["salary"]+2

In [45]:
df

       name  age  salary  location
0  person 1   40     602  kakamega
1  person 2  105     402   mombasa
2  person 3   39     452    kisumu
3  person 4  461     334    moyale
4  person 5   72   75002  marsabit

In [51]:
df["age"],df ["salary"]= df["age"]+1, df["salary"]+500

In [52]:
df

       name  age  salary  location
0  person 1   41    1102  kakamega
1  person 2  106     902   mombasa
2  person 3   40     952    kisumu
3  person 4  462     834    moyale
4  person 5   73   75502  marsabit